In [2]:
import pandas as pd
import numpy as np

In [4]:
dict1 = {"Names": ['Vidya',"Lalith",np.nan,'Siri'],
        'Age':[np.nan,21,22,23],
        'City':['Hyd','Blr','Chennai',np.nan]}
dict1

{'Names': ['Vidya', 'Lalith', nan, 'Siri'],
 'Age': [nan, 21, 22, 23],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [8]:
d1 = pd.DataFrame(dict1)
d1

    Names   Age     City
0   Vidya   NaN      Hyd
1  Lalith  21.0      Blr
2     NaN  22.0  Chennai
3    Siri  23.0      NaN

In [7]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [9]:
dict2 = {"Names": ['Vidya',"Lalith",None,'Siri'],
        'Age':[np.nan,21,22,23],
        'City':['Hyd','Blr','Chennai',None]}
dict2

{'Names': ['Vidya', 'Lalith', None, 'Siri'],
 'Age': [nan, 21, 22, 23],
 'City': ['Hyd', 'Blr', 'Chennai', None]}

In [10]:
d2 = pd.DataFrame(dict2)
d2

    Names   Age     City
0   Vidya   NaN      Hyd
1  Lalith  21.0      Blr
2    None  22.0  Chennai
3    Siri  23.0     None

In [11]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [12]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [13]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

- np.nan : not a number this applicable for numerical column only

- Generally data has some empty rows

- It is a data problem

- If you read that kind of data, you will see Null

- You need to understand it is a data corrupted or really a Null values are there

**Method-1**

**Fill with random values**

**Method name: fill na**

In [14]:
d1.fillna(40)

    Names   Age     City
0   Vidya  40.0      Hyd
1  Lalith  21.0      Blr
2      40  22.0  Chennai
3    Siri  23.0       40

**Method-2**

**Fill values w.r.t columns seperately**

In [18]:
d1['Names'].fillna('sai', inplace=True)

In [20]:
d1['Age'].fillna(40, inplace=True)

In [22]:
d1['City'].fillna('delhi', inplace=True)

In [23]:
d1

    Names   Age     City
0   Vidya  40.0      Hyd
1  Lalith  21.0      Blr
2     sai  22.0  Chennai
3    Siri  23.0    delhi

In [24]:
dict1 = {"Names": ['Vidya',"Lalith",np.nan,'Siri'],
        'Age':[np.nan,21,22,23],
        'City':['Hyd','Blr','Chennai',np.nan]}
d1 = pd.DataFrame(dict1)

**Method-3**

- bfill

- ffill

- pad

- backfill

In [25]:
d1.fillna(method='bfill')

C:\Users\Owner\AppData\Local\Temp\ipykernel_29972\1914124427.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

    Names   Age     City
0   Vidya  21.0      Hyd
1  Lalith  21.0      Blr
2    Siri  22.0  Chennai
3    Siri  23.0      NaN

In [26]:
d1.fillna(method='ffill')

C:\Users\Owner\AppData\Local\Temp\ipykernel_29972\4088926743.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill')

    Names   Age     City
0   Vidya   NaN      Hyd
1  Lalith  21.0      Blr
2  Lalith  22.0  Chennai
3    Siri  23.0  Chennai

In [27]:
d1.fillna(method='pad')

C:\Users\Owner\AppData\Local\Temp\ipykernel_29972\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

    Names   Age     City
0   Vidya   NaN      Hyd
1  Lalith  21.0      Blr
2  Lalith  22.0  Chennai
3    Siri  23.0  Chennai

In [28]:
d1.fillna(method='backfill')

C:\Users\Owner\AppData\Local\Temp\ipykernel_29972\907203477.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='backfill')

    Names   Age     City
0   Vidya  21.0      Hyd
1  Lalith  21.0      Blr
2    Siri  22.0  Chennai
3    Siri  23.0      NaN

In [30]:
d1.fillna(method='bfill', axis=1)
# axis = 0 filled with rows values
# axis = 1 filled with column values

C:\Users\Owner\AppData\Local\Temp\ipykernel_29972\2298297008.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill', axis=1)

    Names   Age     City
0   Vidya   Hyd      Hyd
1  Lalith  21.0      Blr
2    22.0  22.0  Chennai
3    Siri  23.0      NaN

**Method-4**

- **mean**
   - Numerical values can be filled with mean value
   - but mean is affected with outliers
   - if we don't have outliers it is best one
 
- **median**
   - Numerical values can be filled with median value
   - we know median is not affected by outliers
   - so if there are outliers we can go with median
 
- **mode**
   - Mode is useful for categorical data

In [31]:
# we already know we can fill with some values based on specific column using fillna
# d1.fillna(<random number>)
# d1 represents all the columns

age_mean = d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    22.0
1    21.0
2    22.0
3    23.0
Name: Age, dtype: float64

In [32]:
age_median = d1['Age'].median()
d1['Age'].fillna(age_median)

0    22.0
1    21.0
2    22.0
3    23.0
Name: Age, dtype: float64

In [33]:
d1['City'].mode()

# in this case we are getting mo

0        Blr
1    Chennai
2        Hyd
Name: City, dtype: object

**Method-5**

**KNN imputer**

- KNN means K nearest neighbours

- k is a hyper parameter means user can choose

- it is distance metrics : **Euclidian distance**

- KNN imputer will take the mean of the neighbours value

- The neighbour values can be provided by using value of k

- It is under sklearn package

- Under sklearn we have Imputer method

- Under imuter method we have knnimputer

- Applicable only for numerical data

In [35]:
from sklearn.impute import KNNImputer
knnimp = KNNImputer()
knnimp.fit_transform(d1[['Age']])

array([[22.],
       [21.],
       [22.],
       [23.]])